'''
인공지능(Artificial intelligence): 사고방식이나 학습 등 인간이 가지는 지적 능력을 컴퓨터를 통해 구현하는 기술
머신러닝(Machine Learning) : 컴퓨터가 스스로 학습하여 인공지능의 성능을 향상시키는 기술 방법
딥러닝(Deep Learning) : 인간의 뉴런과 비슷한 인공신경망 방식으로 정보를 처리
인공지능 > 머신러닝 > 딥러닝

머신러닝 : 컴퓨팅 기기에게 데이터를 수집해 학습시킴으로써 인지능력을 가진 인간처럼 판단, 예측 등의 일을 함
        인공지능의 한 분야이며, 응용수학과 통계학에 기초를 둠
        머신러닝에 사용하는 파이썬 도구는 매우 다양(넘파이, 판다스, 매트플롯립 등)

        지도학습 : 기계가 이미 정답이 정해진 데이터를 바탕으로 사람이 원하는 정답의 방햐응로 학습하는 방법
                즉, 대량의 데이터가 저장될수록 더 정확함
                레이블된 데이터, 즉각적인 피드백, 미래 데이터 예측이 용이함
                
        비지도학습 : 기계가 정답이 없는 데이터 집합에서 데이터의 특성을 분석해 군집화하는 학습 방법
                 정확한 학습 환경이 만들어지는 것이 중요
                 레이블 없는 데이터, 즉각적인 피드백이 없음, 데이터의 숨겨진 특징을 발견하는 순기능이 있음
                
        강화학습 : 학습과정에서 정답을 노출한 경우, 보상을 줌으로써 정답을 도출할 가능성을 높이는 학습 방법
                의사결정을 위한 최적의 행동을 선택, 보상 시스템 학습을 의미함

딥러닝 : 인공신경망이 발전한 형태
       2016년 알파고가 프로 바둑기사를 상대로 이김으로써 우리나라에도 널리 알려짐
       구글을 비롯하여 세계적인 기업들이 딥러닝을 다양한 분야에 적용중
       페이스북은 딥러닝을 이용해 얼굴인식 알고리즘을 개발하였고, MS, 구글 등은 음성 비서를 개발하여 보급
       
       데이터 전처리 : 수집된 데이터를 분석하기 좋은 형태로 가공하는 작업
                   딥러닝 전체 프로세스에서 8~90%를 차지
                    
       학습용 데이터 : 딥러닝 학습 과젱에서 필요한 데이터
       
       평가용 데이터 : 학습된 딥러닝 모델을 평가하기 위해 필요한 데이터
                   일반적으로 학습용 데이터를 더욱 많이 배정함
'''
